app/controllers/home_controller.rb

INSERT INTO `recipes` (`protein1`, `protein2`, `protein3`, `protein4`, `protein5`, `veg1`, `veg2`, `veg3`, `veg4`, `veg5`, `starch1`, `starch2`, `starch3`, `starch4`, `starch5`, `oils1`, `oils2`, `oils3`, `oils4`, `oils5`, `aromatics1`, `aromatics2`, `aromatics3`, `aromatics4`, `aromatics5`, `created_at`, `updated_at`) VALUES ('chicken', 'beef', 'tofu', 'garbanzo beans', 'kidney beans', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2022-04-18 23:37:56.699657', '2022-04-18 23:37:56.699657')
---
  def input_protein
    required = [:input1, :input2, :input3, :input4, :input5]
    form_complete = true
    required.each do |f|
      if params.has_key? f and not params[f].blank?
        #do nothing
      else
        form_complete = false
      end
    end
    if form_complete
      form_status_msg = "Great. Let's continue!"
    else
      form_status_msg = "Please fill in all fields."
    end
    @recipe = Recipe.new(protein1: params[:protein][:input1], protein2: params[:protein][:input2], protein3: params[:protein][:input3], protein4: params[:protein][:input4], protein5: params[:protein][:input5])
    if @recipe.save

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` IS NULL LIMIT 1
---
  def veg
    @recipe = Recipe.find(session[:recipe_id])

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 32 LIMIT 1
UPDATE `recipes` SET `recipes`.`veg1` = 'carrot', `recipes`.`updated_at` = '2022-04-18 23:38:01.918399' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`veg2` = 'tomato', `recipes`.`updated_at` = '2022-04-18 23:38:01.923664' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`veg3` = 'radish', `recipes`.`updated_at` = '2022-04-18 23:38:01.927901' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`veg4` = 'mushroom', `recipes`.`updated_at` = '2022-04-18 23:38:01.932304' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`veg5` = 'cucumber', `recipes`.`updated_at` = '2022-04-18 23:38:01.936429' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`veg1` = 'carrot', `recipes`.`updated_at` = '2022-04-18 22:51:10.765134' WHERE `recipes`.`id` = 24
---
  def input_veg
    required = [:input1, :input2, :input3, :input4, :input5]
    form_complete = true
    required.each do |f|
      if params.has_key? f and not params[f].blank?
        #do nothing
      else
        form_complete = false
      end
    end
    if form_complete
      form_status_msg = "Great. Let's continue!"
    else
      form_status_msg = "Please fill in all fields."
    end
    #respond_to do |format|
      #format.html {render :veg, locals: {status_msg: form_status_msg, feedback: params}}
    #end
    #@recipe=Recipe1.order('id ASC')
    @recipe = Recipe.find(session[:recipe_id])
    @recipe.update_attribute(:veg1, params[:veg][:input1])
    @recipe.update_attribute(:veg2, params[:veg][:input2])
    @recipe.update_attribute(:veg3, params[:veg][:input3])
    @recipe.update_attribute(:veg4, params[:veg][:input4])
    @recipe.update_attribute(:veg5, params[:veg][:input5])
    if @recipe.save

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 32 LIMIT 1
UPDATE `recipes` SET `recipes`.`aromatics1` = 'mint', `recipes`.`updated_at` = '2022-04-18 23:38:07.560107' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`aromatics2` = 'salt', `recipes`.`updated_at` = '2022-04-18 23:38:07.564757' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`aromatics3` = 'pepper', `recipes`.`updated_at` = '2022-04-18 23:38:07.569382' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`aromatics4` = 'cumin', `recipes`.`updated_at` = '2022-04-18 23:38:07.573951' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`aromatics5` = 'basil', `recipes`.`updated_at` = '2022-04-18 23:38:07.578371' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`aromatics1` = 'mint', `recipes`.`updated_at` = '2022-04-18 23:30:07.711104' WHERE `recipes`.`id` = 31
---
  def input_aromatics
    required = [:input1, :input2, :input3, :input4, :input5]
    form_complete = true
    required.each do |f|
      if params.has_key? f and not params[f].blank?
        #do nothing
      else
        form_complete = false
      end
    end
    if form_complete
      form_status_msg = "Great. Let's continue!"
    else
      form_status_msg = "Please fill in all fields."
    end
    @recipe = Recipe.find(session[:recipe_id])
    @recipe.update_attribute(:aromatics1, params[:aromatics][:input1])
    @recipe.update_attribute(:aromatics2, params[:aromatics][:input2])
    @recipe.update_attribute(:aromatics3, params[:aromatics][:input3])
    @recipe.update_attribute(:aromatics4, params[:aromatics][:input4])
    @recipe.update_attribute(:aromatics5, params[:aromatics][:input5])
    if @recipe.save

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 32 LIMIT 1
UPDATE `recipes` SET `recipes`.`oils1` = 'veggie', `recipes`.`updated_at` = '2022-04-18 23:38:13.660726' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`oils2` = 'olive', `recipes`.`updated_at` = '2022-04-18 23:38:13.665043' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`oils3` = 'avocado', `recipes`.`updated_at` = '2022-04-18 23:38:13.669762' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`oils4` = 'sesame', `recipes`.`updated_at` = '2022-04-18 23:38:13.674233' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`oils5` = 'etc.', `recipes`.`updated_at` = '2022-04-18 23:38:13.679362' WHERE `recipes`.`id` = 32
UPDATE `recipes` SET `recipes`.`oils1` = 'veggie', `recipes`.`updated_at` = '2022-04-18 23:33:10.684618' WHERE `recipes`.`id` = 31
---
  def input_oils
    required = [:input1, :input2, :input3, :input4, :input5]
    form_complete = true
    required.each do |f|
      if params.has_key? f and not params[f].blank?
        #do nothing
      else
        form_complete = false
      end
    end
    if form_complete
      form_status_msg = "Great. Let's continue!"
    else
      form_status_msg = "Please fill in all fields."
    end
    @recipe = Recipe.find(session[:recipe_id])
    @recipe.update_attribute(:oils1, params[:oils][:input1])
    @recipe.update_attribute(:oils2, params[:oils][:input2])
    @recipe.update_attribute(:oils3, params[:oils][:input3])
    @recipe.update_attribute(:oils4, params[:oils][:input4])
    @recipe.update_attribute(:oils5, params[:oils][:input5])
    if @recipe.save

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 36 LIMIT 1
UPDATE `recipes` SET `recipes`.`starch1` = 'rigatoni', `recipes`.`updated_at` = '2022-04-19 02:19:26.138774' WHERE `recipes`.`id` = 36
UPDATE `recipes` SET `recipes`.`starch2` = 'rice', `recipes`.`updated_at` = '2022-04-19 02:19:26.145819' WHERE `recipes`.`id` = 36
UPDATE `recipes` SET `recipes`.`starch3` = 'lingineue', `recipes`.`updated_at` = '2022-04-19 02:19:26.150495' WHERE `recipes`.`id` = 36
UPDATE `recipes` SET `recipes`.`starch4` = 'potatoes', `recipes`.`updated_at` = '2022-04-19 02:19:26.156104' WHERE `recipes`.`id` = 36
UPDATE `recipes` SET `recipes`.`starch5` = 'orzo', `recipes`.`updated_at` = '2022-04-19 02:19:26.160950' WHERE `recipes`.`id` = 36
---
  def input_starch
    required = [:input1, :input2, :input3, :input4, :input5]
    form_complete = true
    required.each do |f|
      if params.has_key? f and not params[f].blank?
        #do nothing
      else
        form_complete = false
      end
    end
    if form_complete
      form_status_msg = "Great. Let's continue!"
    else
      form_status_msg = "Please fill in all fields."
    end
    @recipe = Recipe.find(session[:recipe_id])
    @recipe.update_attribute(:starch1, params[:starch][:input1])
    @recipe.update_attribute(:starch2, params[:starch][:input2])
    @recipe.update_attribute(:starch3, params[:starch][:input3])
    @recipe.update_attribute(:starch4, params[:starch][:input4])
    @recipe.update_attribute(:starch5, params[:starch][:input5])

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 46 LIMIT 1
---
  def results
    respond_to do |format|
      format.html {render :results}
    @recipe = Recipe.find(session[:recipe_id])